model {
  center_net {
    num_classes: 1
    feature_extractor {
      type: "hourglass_104"
      channel_means: 104.01362
      channel_means: 114.034225
      channel_means: 119.916595
      channel_stds: 73.60277
      channel_stds: 69.89082
      channel_stds: 70.91508
      bgr_ordering: true
    }
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 512
        max_dimension: 512
        pad_to_max_dimension: true
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
      min_box_overlap_iou: 0.7
      max_box_predictions: 100
    }
    keypoint_label_map_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/keypoint_label_map.pbtxt"
    keypoint_estimation_task {
      task_name: "human_pose"
      task_loss_weight: 1.0
      loss {
        localization_loss {
          l1_localization_loss {
          }
        }
        classification_loss {
          penalty_reduced_logistic_focal_loss {
            alpha: 2.0
            beta: 4.0
          }
        }
      }
      keypoint_class_name: "person"
      keypoint_label_to_std {
        key: "left_ankle"
        value: 0.89
      }
      keypoint_label_to_std {
        key: "left_ear"
        value: 0.35
      }
      keypoint_label_to_std {
        key: "left_elbow"
        value: 0.72
      }
      keypoint_label_to_std {
        key: "left_eye"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "left_hip"
        value: 1.07
      }
      keypoint_label_to_std {
        key: "left_knee"
        value: 0.89
      }
      keypoint_label_to_std {
        key: "left_shoulder"
        value: 0.79
      }
      keypoint_label_to_std {
        key: "left_wrist"
        value: 0.62
      }
      keypoint_label_to_std {
        key: "nose"
        value: 0.26
      }
      keypoint_label_to_std {
        key: "right_ankle"
        value: 0.89
      }
      keypoint_label_to_std {
        key: "right_ear"
        value: 0.35
      }
      keypoint_label_to_std {
        key: "right_elbow"
        value: 0.72
      }
      keypoint_label_to_std {
        key: "right_eye"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "right_hip"
        value: 1.07
      }
      keypoint_label_to_std {
        key: "right_knee"
        value: 0.89
      }
      keypoint_label_to_std {
        key: "right_shoulder"
        value: 0.79
      }
      keypoint_label_to_std {
        key: "right_wrist"
        value: 0.62
      }
      keypoint_regression_loss_weight: 0.03
      keypoint_heatmap_loss_weight: 0.9
      keypoint_offset_loss_weight: 0.4
      offset_peak_radius: 3
      per_keypoint_offset: true
    }
  }
}
train_config {
  batch_size: 4
  data_augmentation_options {
    random_horizontal_flip {
      keypoint_flip_permutation: 0
      keypoint_flip_permutation: 2
      keypoint_flip_permutation: 1
      keypoint_flip_permutation: 4
      keypoint_flip_permutation: 3
      keypoint_flip_permutation: 6
      keypoint_flip_permutation: 5
      keypoint_flip_permutation: 8
      keypoint_flip_permutation: 7
      keypoint_flip_permutation: 10
      keypoint_flip_permutation: 9
      keypoint_flip_permutation: 12
      keypoint_flip_permutation: 11
      keypoint_flip_permutation: 14
      keypoint_flip_permutation: 13
      keypoint_flip_permutation: 16
      keypoint_flip_permutation: 15
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_aspect_ratio: 0.5
      max_aspect_ratio: 1.7
      random_coef: 0.25
    }
  }
  data_augmentation_options {
    random_adjust_hue {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_absolute_pad_image {
      max_height_padding: 200
      max_width_padding: 200
      pad_color: 0.0
      pad_color: 0.0
      pad_color: 0.0
    }
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.001
          total_steps: 250000
          warmup_learning_rate: 0.00025
          warmup_steps: 5000
        }
      }
      epsilon: 1e-07
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/centernet_hg104_512x512_kpts_coco17_tpu-32/checkpoint/ckpt-0"
  num_steps: 5000
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00000-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00001-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00002-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00003-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00004-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00005-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00006-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00007-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00008-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00009-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00010-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00011-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00012-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00013-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00014-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00015-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00016-of-00100"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_train.record-00017-of-00100"
  }
  num_keypoints: 17
}
eval_config {
  num_visualizations: 10
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  min_score_threshold: 0.2
  max_num_boxes_to_visualize: 20
  batch_size: 1
  parameterized_metric {
    coco_keypoint_metrics {
      class_label: "person"
      keypoint_label_to_sigmas {
        key: "left_ankle"
        value: 0.089
      }
      keypoint_label_to_sigmas {
        key: "left_ear"
        value: 0.035
      }
      keypoint_label_to_sigmas {
        key: "left_elbow"
        value: 0.072
      }
      keypoint_label_to_sigmas {
        key: "left_eye"
        value: 0.025
      }
      keypoint_label_to_sigmas {
        key: "left_hip"
        value: 0.107
      }
      keypoint_label_to_sigmas {
        key: "left_knee"
        value: 0.087
      }
      keypoint_label_to_sigmas {
        key: "left_shoulder"
        value: 0.079
      }
      keypoint_label_to_sigmas {
        key: "left_wrist"
        value: 0.062
      }
      keypoint_label_to_sigmas {
        key: "nose"
        value: 0.026
      }
      keypoint_label_to_sigmas {
        key: "right_ankle"
        value: 0.089
      }
      keypoint_label_to_sigmas {
        key: "right_ear"
        value: 0.035
      }
      keypoint_label_to_sigmas {
        key: "right_elbow"
        value: 0.072
      }
      keypoint_label_to_sigmas {
        key: "right_eye"
        value: 0.025
      }
      keypoint_label_to_sigmas {
        key: "right_hip"
        value: 0.107
      }
      keypoint_label_to_sigmas {
        key: "right_knee"
        value: 0.087
      }
      keypoint_label_to_sigmas {
        key: "right_shoulder"
        value: 0.079
      }
      keypoint_label_to_sigmas {
        key: "right_wrist"
        value: 0.062
      }
    }
  }
  keypoint_edge {
    start: 0
    end: 1
  }
  keypoint_edge {
    start: 0
    end: 2
  }
  keypoint_edge {
    start: 1
    end: 3
  }
  keypoint_edge {
    start: 2
    end: 4
  }
  keypoint_edge {
    start: 0
    end: 5
  }
  keypoint_edge {
    start: 0
    end: 6
  }
  keypoint_edge {
    start: 5
    end: 7
  }
  keypoint_edge {
    start: 7
    end: 9
  }
  keypoint_edge {
    start: 6
    end: 8
  }
  keypoint_edge {
    start: 8
    end: 10
  }
  keypoint_edge {
    start: 5
    end: 6
  }
  keypoint_edge {
    start: 5
    end: 11
  }
  keypoint_edge {
    start: 6
    end: 12
  }
  keypoint_edge {
    start: 11
    end: 12
  }
  keypoint_edge {
    start: 11
    end: 13
  }
  keypoint_edge {
    start: 13
    end: 15
  }
  keypoint_edge {
    start: 12
    end: 14
  }
  keypoint_edge {
    start: 14
    end: 16
  }
}
eval_input_reader {
  label_map_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00000-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00001-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00002-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00003-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00004-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00005-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00006-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00007-of-00050"
    input_path: "/Users/dharrensandhi/PycharmProjects/model_1_keypoint_detection/model_1_scripts/tfrecord/coco_val.record-00008-of-00050"
  }
  num_keypoints: 17
}
